In [2]:
import pandas as pd
import numpy as np

In [5]:
s=pd.Series(['p', 'a', 'n', 'd', 'a','s', 'e', 'r', 'i', 'e','s'])
s

0     p
1     a
2     n
3     d
4     a
5     s
6     e
7     r
8     i
9     e
10    s
dtype: object

In [7]:
d = {'b': 1, 'a': 0, 'c': 2}
s=pd.Series(d)
s

b    1
a    0
c    2
dtype: int64

In [16]:
s=pd.Series(['p', ' ','a', 'n', 'd'], index=['a', 'b', 'c', 'd', 'e'])
s

a    p
b
c    a
d    n
e    d
dtype: object

In [18]:
s['b']

''

In [20]:
s['d']

'n'

In [23]:
s[2]

'a'

In [25]:
s[3]

'n'

In [34]:
s

a    p
b
c    a
d    n
e    d
dtype: object

In [28]:
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [30]:
s[2:4]

c    a
d    n
dtype: object

In [32]:
s.loc['c']

'a'

In [36]:
s.iloc[1]

''

In [64]:
data = pd.Series([5, 2, 3,7], index=['a', 'b', 'c', 'd'])
data1 = pd.Series([1, 6, 4, 9], index=['a', 'b', 'd', 'e'])
print(data,end='\n')
print(data1)

a    5
b    2
c    3
d    7
dtype: int64
a    1
b    6
d    4
e    9
dtype: int64

In [66]:
data.add(data1)

a     6.0
b     8.0
c     NaN
d    11.0
e     NaN
dtype: float64

In [99]:
df=pd.read_csv('C:\\MyData\\Python\\DataSet\\weather.csv')
df.columns

Index(['date', 'maximum temperature', 'minimum temperature',
       'average temperature', 'precipitation', 'snow fall', 'snow depth'],
      dtype='object')

In [100]:
df.dtypes

date                    object
maximum temperature      int64
minimum temperature      int64
average temperature    float64
precipitation           object
snow fall               object
snow depth              object
dtype: object

In [101]:
df.dropna(inplace = True)

In [85]:
from pandas import Series

In [106]:
df['snow depth']=df['snow depth'].astype(str)

In [108]:
df.dtypes

date                    object
maximum temperature      int64
minimum temperature      int64
average temperature    float64
precipitation           object
snow fall               object
snow depth              object
minimum temperatur     float64
dtype: object

In [21]:
data = {'Name':['Jai', np.nan, 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],
        'Address':['Delhi', 'Kanpur', np.nan, 'Kannauj'],
        'Qualification':['Msc', 'MA', 'MCA', np.nan]}
df = pd.DataFrame(data)
df

     Name  Age  Address Qualification
0     Jai   27    Delhi           Msc
1     NaN   24   Kanpur            MA
2  Gaurav   22      NaN           MCA
3    Anuj   32  Kannauj           NaN

In [113]:
df.isnull()

    Name    Age  Address  Qualification
0  False  False    False          False
1   True  False    False          False
2  False  False     True          False
3  False  False    False           True

In [115]:
df.notnull()

    Name   Age  Address  Qualification
0   True  True     True           True
1  False  True     True           True
2   True  True    False           True
3   True  True     True          False

In [120]:
df['age']=[3,np.nan,25,40]
df

     Name  Age  Address Qualification   age
0     Jai   27    Delhi           Msc   3.0
1     NaN   24   Kanpur            MA   NaN
2  Gaurav   22      NaN           MCA  25.0
3    Anuj   32  Kannauj           NaN  40.0

In [121]:
del df['age']
df

     Name  Age  Address Qualification
0     Jai   27    Delhi           Msc
1     NaN   24   Kanpur            MA
2  Gaurav   22      NaN           MCA
3    Anuj   32  Kannauj           NaN

In [22]:
df

     Name  Age  Address Qualification
0     Jai   27    Delhi           Msc
1     NaN   24   Kanpur            MA
2  Gaurav   22      NaN           MCA
3    Anuj   32  Kannauj           NaN

In [15]:
df.set_index('Age',inplace=True)
df

       Name  Address Qualification
Age
27      Jai    Delhi           Msc
24      NaN   Kanpur            MA
22   Gaurav      NaN           MCA
32     Anuj  Kannauj           NaN

In [23]:
df.reset_index(inplace=True)

In [24]:
df.set_index('Name',inplace=True)

In [25]:
df

        index  Age  Address Qualification
Name
Jai         0   27    Delhi           Msc
NaN         1   24   Kanpur            MA
Gaurav      2   22      NaN           MCA
Anuj        3   32  Kannauj           NaN

In [28]:
df.reindex('Age')

TypeError: Index(...) must be called with a collection of some kind, 'Age' was passed

In [29]:
df

        index  Age  Address Qualification
Name
Jai         0   27    Delhi           Msc
NaN         1   24   Kanpur            MA
Gaurav      2   22      NaN           MCA
Anuj        3   32  Kannauj           NaN

In [8]:
df.sort_values(by='Age')

     Name  Age  Address Qualification
2  Gaurav   22      NaN           MCA
1     NaN   24   Kanpur            MA
0     Jai   27    Delhi           Msc
3    Anuj   32  Kannauj           NaN